modm-ext/archive-stmicro-svd/header_stm32c011d6y6.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <baseAddress>0x40010000</baseAddress>
      <registers>
        <register>
          <name>CFGR1</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MEM_MODE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PA11_RMP</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA12_RMP</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IR_POL</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IR_MOD</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BOOSTEN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C_PB6_FMP</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C_PB7_FMP</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C_PB8_FMP</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C_PB9_FMP</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1_FMP</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C2_FMP</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C_PA9_FMP</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C_PA10_FMP</name>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C_PC14_FMP</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR3</name>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PINMUX0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PINMUX1</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PINMUX2</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PINMUX3</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PINMUX4</name>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PINMUX5</name>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IT_LINE_SR.0</name>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.1</name>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.2</name>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.3</name>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.4</name>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.5</name>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.6</name>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.7</name>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.8</name>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.9</name>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.10</name>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.11</name>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.12</name>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.13</name>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.14</name>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.15</name>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.16</name>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.17</name>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.18</name>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.19</name>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.20</name>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.21</name>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.22</name>
          <addressOffset>0xd8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.23</name>
          <addressOffset>0xdc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.24</name>
          <addressOffset>0xe0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.25</name>
          <addressOffset>0xe4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.26</name>
          <addressOffset>0xe8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.27</name>
          <addressOffset>0xec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.28</name>
          <addressOffset>0xf0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.29</name>
          <addressOffset>0xf4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.30</name>
          <addressOffset>0xf8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IT_LINE_SR.31</name>
          <addressOffset>0xfc</addressOffset>
          <size>0x20</size>
        </register>
